src/DataProcessors/инкПечатьТ53/инкПечатьТ53.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>инкПечатьТ53</name>
  <attributes>
    <name>ВедомостьНаВыплатуЗарплаты</name>
    <type>
      <types>DocumentRef.инкВедомостьНаВыплатуЗарплаты</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/Enums/инкСпособыВыплатыЗарплаты/инкСпособыВыплатыЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкСпособыВыплатыЗарплаты</name>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
  <enumValues>
    <name>Аванс</name>
  </enumValues>
  <enumValues>
    <name>ПоВидамУдержаний</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/инкОрганизации/инкОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>инкОрганизации</name>
  <attributes>
    <name>Бухгалтер</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтпускДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИФНСАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИФНСКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИФНСНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИФНСТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кадровик</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКДП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКОПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОтпускДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредприятиеМалогоИлиСреднегоБизнеса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчет</name>
    <type>
      <types>CatalogRef.инкРасчетныеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоКемВыдано</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СистемаНалогооблажения</name>
    <type>
      <types>EnumRef.инкСистемаНалогооблажения</types>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоМесяцаВыплатыЗарплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/инкПечатьТ53/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция - Получить печатный документ ведомости на сервере
//
// Параметры:
//  ДокументВедомость	 - Ссылка	 - Ссылка на документ (источник данных);
// 
// Возвращаемое значение:
//  ТабличныйДокумент - Кадровый отчет Т-53 для печати;
//
Функция ПолучитьПечатныйДокументВедомостиНаСервере(ДокументВедомость) Экспорт
	
	МакетВедомости = ПолучитьОбщийМакет("инкПФ_MXL_Т53"); 
	ВедомостьТабличныйДокумент = Новый ТабличныйДокумент;
	
	СуммаДокумента = ДокументВедомость.СуммаДокумента;
	СуммаДокументаРубли = Цел(СуммаДокумента);
    СуммаДокументаКопейки = Прав(Строка(100+(СуммаДокумента-СуммаДокументаРубли)*100),2);
	
	СуммаДокументаПрописью 		= инкОтчетыСервер.ЧислоПрописьюРублиКопейки(СуммаДокумента); 
	СуммаДепонированоПрописью 	= инкОтчетыСервер.ЧислоПрописьюРублиКопейки(0);
	
	РуководительДанные = Справочники.инкОрганизации.КадровыеДанныеРуководителя(ДокументВедомость.Организация);
	БухгалтерДанные  = Справочники.инкОрганизации.КадровыеДанныеБухгалтера(ДокументВедомость.Организация);
	
	ОбластьДокумента = МакетВедомости.ПолучитьОбласть("ШапкаДокумента");
	ОбластьДокумента.Параметры.КодПоОКПО 			= ДокументВедомость.Организация.ОКПО; 	
	ОбластьДокумента.Параметры.НазваниеОрганизации	= ДокументВедомость.Организация;						
	ОбластьДокумента.Параметры.Подразделение		= ДокументВедомость.Подразделение;					
	ОбластьДокумента.Параметры.СуммаДок				= СуммаДокументаПрописью;						
	ОбластьДокумента.Параметры.СуммаДокРублей      	= СуммаДокументаРубли;
	ОбластьДокумента.Параметры.СуммаДокКопеек       = СуммаДокументаКопейки;
	ОбластьДокумента.Параметры.РуководительДолжность= РуководительДанные.Должность;	
	ОбластьДокумента.Параметры.Руководитель			= РуководительДанные.ФИОСокращенное;
	ОбластьДокумента.Параметры.ГлавныйБухгалтер		= БухгалтерДанные.ФИОСокращенное;
	
	// ПЛАТЕЖНАЯ ВЕДОМОСТЬ:
	ОбластьДокумента.Параметры.Номер	= ДокументВедомость.Номер;	
	ОбластьДокумента.Параметры.Дата	    = ДокументВедомость.Дата;

	ОбластьДокумента.Параметры.ОтчетныйПериодС	= НачалоМесяца(ДокументВедомость.ДатаВыплаты);
	ОбластьДокумента.Параметры.ОтчетныйПериодПо = КонецМесяца(ДокументВедомость.ДатаВыплаты);
	Если ДокументВедомость.СпособВыплатыЗарплаты = Перечисления.инкСпособыВыплатыЗарплаты.Аванс Тогда
		ОбластьДокумента.Параметры.ОтчетныйПериодПо = НачалоМесяца(ДокументВедомость.ДатаВыплаты) + 60*60*24*14;	
	КонецЕсли;
	
	ВедомостьТабличныйДокумент.Вывести(ОбластьДокумента);
	
	ОбластьДокумента = МакетВедомости.ПолучитьОбласть("Шапка");
	ВедомостьТабличныйДокумент.Вывести(ОбластьДокумента);
	
	Для каждого ЗарплатаСтрока Из ДокументВедомость.Зарплата Цикл
		ОбластьДокумента = МакетВедомости.ПолучитьОбласть("Строка");
		ОбластьДокумента.Параметры.НомерСтроки		= ЗарплатаСтрока.НомерСтроки;
		ОбластьДокумента.Параметры.ТабельныйНомер   = ЗарплатаСтрока.Сотрудник.ТабельныйНомер;
		ОбластьДокумента.Параметры.Физлицо			= ЗарплатаСтрока.Сотрудник.ФИОСокращенное;
		ОбластьДокумента.Параметры.Сумма	        = ЗарплатаСтрока.КВыплате;
		ОбластьДокумента.Параметры.ЗаписьОДепонировании	= "";
		ВедомостьТабличныйДокумент.Вывести(ОбластьДокумента);
	КонецЦикла;
	
	ОбластьДокумента = МакетВедомости.ПолучитьОбласть("ИтогПоЛисту");
	ОбластьДокумента.Параметры.ИтогоНаСтранице = СуммаДокумента;	
	ВедомостьТабличныйДокумент.Вывести(ОбластьДокумента);
	
	ОбластьДокумента = МакетВедомости.ПолучитьОбласть("Подвал");  
	ОбластьДокумента.Параметры.КоличествоЛистов 	= 1;
	ОбластьДокумента.Параметры.ВсегоВыплачено		= "";								
	ОбластьДокумента.Параметры.ВсегоДепонировано	= "";									
	ОбластьДокумента.Параметры.КассирДолжность		= "Кассир";	
	ОбластьДокумента.Параметры.Кассир				= БухгалтерДанные.ФИОСокращенное;
	ОбластьДокумента.Параметры.Бухгалтер		 	= БухгалтерДанные.ФИОСокращенное;
	ВедомостьТабличныйДокумент.Вывести(ОбластьДокумента);
	
	ВедомостьТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ВедомостьТабличныйДокумент; 
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
//
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//
#КонецОбласти

#КонецЕсли
